In [1]:
import pandas as pd

In [2]:
employee = pd.DataFrame({
    'empId': [3, 1, 2, 4],
    'name': ['Brad', 'John', 'Dan', 'Thomas'],
    'supervisor': [None, 3, 3, 3],
    'salary': [4000, 1000, 2000, 4000]
})

In [3]:
employee

   empId    name  supervisor  salary
0      3    Brad         NaN    4000
1      1    John         3.0    1000
2      2     Dan         3.0    2000
3      4  Thomas         3.0    4000

In [4]:
bonus = pd.DataFrame({
    'empId': [2, 4],
    'bonus': [500, 2000]
})

In [5]:
bonus

   empId  bonus
0      2    500
1      4   2000

In [7]:
df = employee.merge(bonus, how= 'left', on= 'empId')

In [10]:
df[(df['bonus'].isna())| (df['bonus'] < 1000)][['name', 'bonus']]

   name  bonus
0  Brad    NaN
1  John    NaN
2   Dan  500.0